## Задача - Обратный порядок 2

### Условия 

Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.

### Формат входных данных

На вход программе подаётся натуральное число.

### Формат выходных данных

Программа должна вывести число, записанное в обратном порядке.

### Решение

- Код решения:

  ```python
  num = int(input())
  while num != 0:
      last_digit = num % 10
      print(last_digit, end='')
      num //= 10
  ```
  
### Объяснение работы кода.

Изначально я создал переменную `num = int(input())` для ввода чисел с клавиатуры.

Далее я создал цикл `while` с условием `num != 0`, т.е. пока введённое число не равно нулю, будет выполняться блок кода в теле цикла. 

Блок кода в теле цикла начинается с того, что вычисляется последняя цифра введённого числа `last_digit = number % 10`. 

После того, как она была вычислена идёт команда `print(last_digit, end='')`, выводящая на экран последнюю цифру, но без переноса на следующую строку из-за значения параметра `end=''`(в нём ничего не прописано, а следовательно перенос на следующую строку не происходит и цифры идут друг за другом, как бы в обратном порядке) после чего последняя цифра удаляется с помощью целочисленного деления на 10 - `num //= 10`.



