## Задача - Все вместе

### Условия 

Дано натуральное число. Напишите программу, которая вычисляет:
- сумму его цифр;
- количество цифр в нем;
- произведение его цифр;
- среднее арифметическое его цифр;
- его первую цифру;
- сумму его первой и последней цифры.


### Формат входных данных

На вход программе подаётся натуральное число.

### Формат выходных данных

Программа должна вывести значения указанных величин в указанном порядке, каждое на отдельной строке.

### Решения

- Код 1 решения:

  ```python
  num = int(input())
  
  multiplication_of_digits = 1
  summ_of_digits = 0
  digits_count = 0

  original_last_digit = num % 10
  
  while num:
      last_digit = num % 10
      summ_of_digits += last_digit
      digits_count += 1
      multiplication_of_digits *= last_digit
      average_digit = summ_of_digits / digits_count
      if last_digit // 10 == 0:
          first_digit = last_digit
      first_last_digits_summ = first_digit + last_digit
      num //= 10
      
  print(summ_of_digits)
  print(digits_count)
  print(multiplication_of_digits)
  print(average_digit)
  print(first_digit)
  print(first_last_digits_summ)
  ```


### Объяснение работы кода.

Изначально пытался решить через `while`, но не дошло, как работать и перебирать цифры, ведь из-за невнимательности я забыл, что в условии было сказано, что число больше или равно 10, а значит минимальная цифра была бы 9, а я делал оба значения, что максимальное, что минимальное по нулям и не понимал как ими управлять и манипулировать..

Потом я решил задачу через цикл `for`, который по итогу даже там не нужен, ведь и без него всё спокойно преобразуется в строку и находится.

И уже после этого я решил дорешать через цикл `while` в решении 2.

Сначала я создал переменную `n` для ввода значений - `n = int(input())`.

После этого я создал 2 переменные:
- `max_digit = 0` 
- `min_digit = 9`
  
По сути своей это просто 2 заглушки, но минимальное начальное значение - это максимально возможная цифра - 9, дальше уже пойдут числа.

После этих значений я создал цикл `while` с условием `n > 0`, чтобы тело цикла выполнялось до тех пор, пока число ещё существует.

Далее я создал внутри тела цикла переменную `cur_digit`, принимающую значение последней цифры числа(т.е. число будет перебираться слево-направо).

После этого я переприсвоил переменным `max_digit` и `min_digit` значения:
- `max_digit = max(max_digit, cur_digit)` - здесь берётся начальное значение и сравнивается с текущей цифрой, после чего принимает максимальное из двух цифр.
- `min_digit = min(min_digit, cur_digit)` - здесь берётся начальное значение и также сравнивается с текущей цифрой, но уже принимает минимальное из двух цифр.

После переприсваивания значений последнее число удаляется с помощью целочисленного деления на 10 - `n //= 10`

Ну и под конец, конечно, следует вывод, как в условии задачи:
- print("Максимальная цифра равна", max_digit)
- print("Минимальная цифра равна", min_digit)

Конец!




