## Задача - Все вместе

### Условия 

Дано натуральное число. Напишите программу, которая вычисляет:
- сумму его цифр;
- количество цифр в нем;
- произведение его цифр;
- среднее арифметическое его цифр;
- его первую цифру;
- сумму его первой и последней цифры.


### Формат входных данных

На вход программе подаётся натуральное число.

### Формат выходных данных

Программа должна вывести значения указанных величин в указанном порядке, каждое на отдельной строке.

### Решения

- Код 1 решения:

  ```python
  num = int(input())
  
  multiplication_of_digits = 1
  summ_of_digits = 0
  digits_count = 0

  original_last_digit = num % 10
  
  while num:
      last_digit = num % 10
      summ_of_digits += last_digit
      digits_count += 1
      multiplication_of_digits *= last_digit
      average_digit = summ_of_digits / digits_count
      if last_digit // 10 == 0:
          first_digit = last_digit
      first_last_digits_summ = first_digit + original_last_digit
      num //= 10
      
  print(summ_of_digits)
  print(digits_count)
  print(multiplication_of_digits)
  print(average_digit)
  print(first_digit)
  print(first_last_digits_summ)
  ```


### Объяснение работы кода.

В первую очередь, конечно же, создал переменную `num` для ввода значений - `num = int(input())`.

Потом я создал следующие переменные для подсчёта, произведения и суммы цифр из условий задачи:
- `multiplications_of_digits = 1` - переменная, которая будет хранить произведение всех цифр числа(начальное значение = 1, т.к. умножать на 0 нельзя);
- `summ_of_digits = 0` - переменная, которая будет хранить сумму всех цифр числа(начальное значение = 0);
- `digits_count = 0` - переменная - счётчик, которая будет хранить в себе подсчитанное в цикле количество цифр;
- `original_last_digit = num % 10` - переменная, которая хранит в себе значение последней цифры числа(нужна будет для дальнейших манипуляций с ней, т.к. в цикле в качестве переборочного значения(текущего числа для каждой итерации) я также буду использовать последнюю цифру и её значение в конце цикла в любом случае сведётся к нулю.

Далее уже идёт цикл `while` - `while num:`. Для условия я использовал концепцию truthy/falcy объектов в Python - любое ненулевое значение автоматически будет равняться True и будет приводить к итерации, а как только станет равно 0 - станет Falce и итерации прекратятся(хоть потом я и пойму, что такое условие не самое оптимальное).

В теле цикла:
- создал переменную `last_digit = num % 10` - нужна для перебора всех цифр числа, начиная с последней;
- `summ_of_digits += last_digit` - в каждой итерации прибавляет к последней цифре следующую последнюю цифру(т.к. в конце итерации последняя цифра удаляется целочисленным делением), тем самым вычисляя в итоге сумму всех цифр;
- `digits_count += 1` - при каждой итерации прибавляет к счётчику количества цифр `1`. Как только условия выполнения тела цикла прекращаются - выходит количество цифр в числе.
- `multiplication_of_digits *= last_digit` - при каждой итерации умножает цифры, следующие друг за другом(как работает - описано выше с переменной `summ_of_digits`)
- создал переменную `average_digit = summ_of_digits / digits_count` - вычисляет среднее арифметическое всех цифр числа, используя уже вычисленные сумму всех цифр и их количество(формула нахождения **среднего арифметического**-**сумма_всех_цифр / количество_цифр**)

А вот с нахождением первой цифры числа я долго мучился.. Пытался использовать формулы для её нахождения общие, но они не работали в этом случае))

По итогу сначала начал думать использовать флаг/метку, которая бы вычленяла момент удаления последней цифры числа.

Напомню, что они перебираются в моём коде, начиная с последней и последовательно удаляются с каждой итерацией посредством целочисленного деления на 10. И я понял, что нужно поймать тот момент, когда это вычисление станет равняться 0.

Ну и присвоить переменной `first_digit` значение той последней обрабатываемой цифры.

По итогу реализовал через условный оператор `if` - `if last_digit // 10 == 0: first_digit = last_digit`

Далее создал переменную `first_last_digits_summ = first_digit + original_last_digit`, которая вычисляет сумму первой и последней цифры.

Ну и в конце цикла, чтобы он не был бесконечным и числа корректно проходили один за другим добавил удаление переменной `num` через целочисленное деление - `num //= 10`.

Далее вывел все результаты в нужной последовательности с помощью `print()`.

Конец!




