## Задача - Обратный порядок 1

### Условия 

Дано натуральное число. Напишите программу, которая выводит его цифры в столбик в обратном порядке.

### Формат входных данных

На вход программе подаётся натуральное число.

### Формат выходных данных

Программа должна вывести цифры введённого числа в столбик в обратном порядке.

### Решение

- Код решения:

  ```python
  # Создаём переменную для ввода натурального числа:
  number = int(input())
  # Создаём цикл while с условием - пока число не равно нулю, должно выполняться тело цикла
  while number != 0:
      last_digit = number % 10
      print(last_digit)
      number //= 10
  ```
### Объяснение работы кода.

Изначально я создал переменную `number = int(input())` для ввода чисел с клавиатуры.

Далее я создал цикл `while` с условием `number != 0`, т.е. пока введённое число не равно нулю, будет выполняться блок кода в теле цикла. 

Блок кода в теле цикла начинается с того, что вычисляется последняя цифра введённого числа `last_digit = number % 10`. 

После того, как она была вычислена идёт команда `print(last_digit)`, выводящая на экран последнюю цифру, после чего последняя цифра удаляется с помощью целочисленного деления на 10 - `number //= 10`.



