## Задача - Делители-1

### Условия 

На вход программе подаётся натуральное число **`n`**. Напишите программу, выводящую графическое изображение делимости чисел от **`1`** до **`n`** включительно. В каждой строке необходимо напечатать очередное число и столько символов **`+`**, сколько делителей у этого числа.

### Формат входных данных

На вход программе подаётся натуральное число **`n`**.

### Формат выходных данных

Программа должна вывести графическое изображение чисел от **`1`** до **`n`**, каждое на отдельной строке.

### Решения

- Код 1 решения:

  ```python
  num = int(input())
  
  for i in range(1, num + 1):
      count_of_dividers = 0
      for j in range(1, i + 1):
          if i % j == 0:
              count_of_dividers += 1
      print(i, '+' * count_of_dividers, sep='')
  ```

### Объяснение работы кода.

#### 1 решение

Изначально создал переменную для ввода числа **`num = int(input())`**.

После инициализации переменной, которая будет принимать и хранить число, создал основной цикл **`for i in range(1, num + 1)`**, который будет перебирать значения от 1, до числа включительно. Т.е. если на вход подаётся 5 и поставить функцию **`print(i)`** в теле основного цикла, она выведет подряд **`1 2 3 4 5`**.
Это необходимо для последовательной обработки каждой цифры в числе.
В теле основного цикла я создал переменную **`count_of_dividers = 0`** - это переменная-счётчик, которая будет считать количество делителей у текущей итерируемой цифры и обнуляться с завершением вложенного цикла, т.к. для следующей далее цифры счётчик должен быть равен 0.

После переменной счётчика я создал вложенный цикл **`for j in range(1, i + 1)`**
В функции **`range()`** вложенного цикла также начинаем обрабатывать всё с отнёрки и до итерируемой цифры основного цикла включительно.

Т.е. вот начинается 1 итерация, на вход подаётся цифра 1 и функция **`range(1, i + 1)`** принимает это значение и получает такой вид - **`range(1, 2)`**. 

Далее в теле вложенного цикла осуществляется проверка делимости цифры из основного цикла на цифру внутри вложенного цикла себя - **`if i % j == 0`**, если условие истинно и для цифры из основного цикла, цифра вложенного является делителем - прибавляем к счётчику делителей 1 - **`count_of_dividers += 1`**. 

После окончания вложенного цикла следует функция **`print(i, '+' * count_of_dividers, sep='')`**, где выводится цифра из основного цикла с количеством знаков **`+`**, равным количеству делителей у этой цифры, с удалением пробела посредством оператора **`sep=''`**.

Конец!

## Задача - Численный треугольник 2

### Условия 

На вход программе подаётся натуральное число **`n`**. Напишите программу, которая печатает численный треугольник с высотой, равной **`n`**, в соответствии с примером:
- Пример:
  
  ```python
  1
  2 3
  4 5 6
  7 8 9 10
  11 12 13 14 15
  16 17 18 19 20 21
  ...
  ```


### Формат входных данных

На вход программе подаётся одно натуральное число.

### Формат выходных данных

Программа должна вывести треугольник в соответствии с условием задачи.

### Решения

- Код 1 решения:

  ```python
  num = int(input())
  
  counter = 1
  
  for i in range(1, num + 1):
      print()
      counter_and_i = counter + i
      for j in range(counter, counter_and_i):
          counter += 1
          print(j, end=' ')
  ```

### Объяснение работы кода.

#### 1 решение

Как и в прошлой задаче, создал переменную **`num = int(input())`** которая будет принимать на вход число и хранить его.

Далее создал счётчик - **`counter = 1`**. Почему значение счётчика не **`0`**, а 1?

Всё довольно станет более понятно, когда подойдём к циклу)

После создания переменной-счётчика я создал основной цикл **`for i in range(1, num + 1)`**, который будет перебирать каждую цифру введённого числа, начиная с 1 и заканчивая самим числом включительно.

Далее следует функция **`print()`**, которая нужна для перехода на следующую строку, после каждой итерации(по условию вывода в условиях задачи).

После **`print()`** следует создание и инициализация следующего счётчика) - **`counter_and_i = counter + i`**. 
Этот счётчик при каждой итерации основного цикла будет хранить в себе значение, которое будет верхней границей(невключительной) для вложеннорго цикла.

Далее я создал вложенный цикл - **`for j in range(counter, counter_and_i)`**. В котором начальное значение - это тот самый счётчик, который был создан ещё до цикла и равный 1) Приравнивать его к единице было необходимо для того, чтобы корректно выстраивался диапазон значений во вложенном цикле. 

При каждой итерации вложенного цикла к счётчику **`counter`** прибавляется единица и после этого с помощью функции **`print(j, end=' ')`**, выводится переменная вложенного цикла с пробелом, вместо перевода на следующую строку.

Как это всё вообще работает?

Представим, что нам на вход подаётся.. 3.

Мы её инициализируем в **`num`**, далее идёт счётчик равный единице и начинается основной цикл, который будет выполняться трижды(т.к на вход подана 3 и верхнее значение - включительно). При каждом прохождении цикла, функция **`print()`** в теле основного цикла будет переводить новую ступеньку лестницы на новую строку.

Далее в счётчике **`counter_and_i = counter + i`** мы устанавливаем верхнюю границу для итераций вложенного цикла. Она будет равняться при первой итерации - двум.

Далее во вложенном цикле с переменной **`j`** мы начинаем итерации с первоначальным значением **`counter`**, который сейчас равен единице. И верхней границей, в данный момент равной двум. 

Таким образом будет произведена только 1 итерация вложенного цикла, счётчик для начального значения изменится на следующую последующую после итерируемой цифры - цифру 2. И выведется переменная вложенного цикла с добавлением пробела, вместо переноса на следующую строку. 

Переходим ко второй итерации основного цикла - **`counter = 2`**, далее **`counter_and_i = 4`** т.к. мы сложили значение **`counter`** и текущую итерируемую цифру **`i`**, равную номеру итерации - 2.

Далее вложенный цикл начинает уже со следующей строки, после выведенной единицы в прошлой итерации. 
И диапазон значений в **`range()`** равняется уже следующей по счёту цифре - 2 и выполняется дважды, т.е. выводится уже 2 последующие по счёту цифры. 

Когда наступит третья итерация основного цикла, будут выведены уже 3 цифры и основной цикл завершится.

Т.е. **`counter`** необходим для того, чтобы хранить хронологический счётный порядок цифр, если **`i = 1`**, то после её обработки **`counter`** станет равным двум и так будет осуществляться дальнейший порядок).

Конец !

## Задача - Простые числа

### Условия 

На вход программе подаётся два натуральных числа **`a`** и **`b`**(a < b).
Напишите программу, которая находит все простые числа от **`a`** до **`b`** включительно.

### Формат входных данных

На вход программе подаётся два натуральных числа, каждое на отдельной строке.

### Формат выходных данных

Программа должна вывести все простые числа от **`a`** до **`b`** включительно, каждое на отдельной строке.

### Решения

- Код 1 решения:

  ```python
  num_a = int(input())
  num_b = int(input())
  
  for i in range(num_a, num_b + 1):
      count_of_dividers = 0
      for j in range(1, num_b + 1):
          if i % j == 0 and i % 1 == 0:
              count_of_dividers += 1
      
      if count_of_dividers == 2 and i != 1:
          print(i)
  ```

### Объяснение работы кода.

#### 1 решение

Сразу скажу, что 1 решение абсолютно не оптимизировано, хоть и верно решает задачу.

Для начала я создал 2 переменные для ввода и хранения натуральных чисел - **`num_a = int(input())`** и **`num_b = int(input())`**