## Задача - Вторая цифра

### Условия 

Дано натуральное число n(n>9). Напишите программу, которая определяет его вторую (с начала) цифру.

### Формат входных данных

На вход программе подаётся натуральное число, состоящее как минимум из двух цифр.

### Формат выходных данных

Программа должна вывести его вторую (с начала) цифру.

### Решения

- Код 1 решения:

  ```python
  num = int(input())
  
  num_for_manipulation = num
  
  digits_count = 0
  
  while num_for_manipulation > 0:
      current_digit = num_for_manipulation % 10
      digits_count += 1
      num_for_manipulation //= 10
  
  second_digit = (num // 10 ** (digits_count - 2)) % 10
  
  print(int(second_digit))
  ```
  
- Код 2 решения:

  ```python
  n = int(input())
  while n > 99:
      n //= 10
  
  second_digit = n % 10
  print(second_digit)
  ```


### Объяснение работы кода.

#### 1 решение

В первую очередь, конечно же, создал переменную `num` для ввода значений - `num = int(input())`.

Далее я создал переменную `num_for_manipulation`, которая нужна только для подсчёта цифр в введённом числе через цикл `while` и в последствии будет полностью обнуляться. А изначальное значение `num` будет сохранено для вычисления второй цифры.

Далее идёт переменная-счётчик `digits_count = 0`, которая будет прибавлять по единице за каждую итерацию цикла.

После переменной-счётчика идёт уже сам цикл `while` с условием `while num_for_manipulation > 0`: т.е. будет выполняться, пока переменная не равна 0.

В теле цикла:

- для текущего значения внутри цикла создал переменую `current_digit = num_for_manipulation % 10`(последняя цифра числа та самая))));
- далее идёт прибавка единицы за каждую итерацию к перменной-счётчику: `digits_count += 1`;
- ну и в конце как обычно удаляется текущее значение: `num_for_manipulation //= 10`.

После цикла я создал переменную `second_digit`, которая с помощью формулы вычисляет вторую цифру числа - `second_digit = (num // 10 ** (digits_count - 2)) % 10`.

В самом конце решения я использовал `print`, чтобы вывести всё на экран. Но не всё так просто))) Ведь при таком делении нам возвращается число с плавающей точкой - `float`, а нам нужно целое число - `integer`. Поэтому в вывод выглядит так: `print(int(second_digit))` внутри функция `int` приводит всё к целочисленному типу данных.

Но 1 решение не самое оптимальное.

#### 2 решение

Также создана переменная `n = int(input())` для ввода значений.

После неё сразу же  идёт цикл `while` с условием: `while n > 99`, т.е. как только число становится больше 99, выполняется тело цикла.

В теле цикла производится целочисленное деление на 10(т.е. мы приводим любое число к двухзначному) и после того, как число становится двухзначным - цикл завершается.

Далее идёт переменная для вычисления второй цифры - `second_digit = n % 10`, которая попросту возвращает последнюю цифру, т.е. вторую цифру исходного числа)

И уже обыкновенный `print(second_digit`.

Конец!
